In [2]:
import pandas as pd
from pathlib import Path

In [3]:
school_data_to_load = Path("Resources/schools_complete.csv")
student_data_to_load = Path("Resources/students_complete.csv")

In [21]:
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [26]:
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [6]:
school_count = len(school_data_complete["school_name"].unique())
school_count

15

In [7]:
total_students = len(school_data_complete["student_name"].unique())
total_students

32715

In [14]:
school_budget = school_data_complete["budget"].mean()
school_budget

2117240.989481746

In [25]:
math_passing = school_data_complete.loc[school_data_complete["math_score"] > 69, [
    "student_name", "school_name", "math_score"]]
math_passing

          student_name         school_name  math_score
0         Paul Bradley   Huang High School          79
4           Bonnie Ray   Huang High School          84
5        Bryan Miranda   Huang High School          94
6        Sheena Carter   Huang High School          80
8         Michael Roth   Huang High School          87
...                ...                 ...         ...
39165     Donna Howard  Thomas High School          90
39166        Dawn Bell  Thomas High School          70
39167   Rebecca Tanner  Thomas High School          84
39168     Desiree Kidd  Thomas High School          90
39169  Carolyn Jackson  Thomas High School          75

[29370 rows x 3 columns]

In [28]:
percent_math = 29370 / (total_students)
percent_math

0.8977533241632278

In [22]:
school_data.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [24]:
student_data.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75